artillery/scenarios/api_v4_projects_merge_requests.yml
config:
  http:
    pool: 10

  defaults:
    headers:
      Content-Type: "application/json"

  plugins:
    expect: {}

  phases:
    - duration: 2
      arrivalRate: 2
      rampTo: 20
      name: "Warm up"

    - duration: 10
      arrivalRate: 20
      name: "Load"

scenarios:
  - flow:
      - get:
          url: /api/v4/projects/{{GITLABHQ_GROUP}}%2F{{GITLABHQ_PROJECT}}/merge_requests
          expect:
            - statusCode: 200