artillery/scenarios/api_v4_projects_merge_requests.yml
config:
  defaults:
    headers:
      Accept: "application/json"

  ensure:
    maxErrorRate: 1

  plugins:
    expect: {}

  phases:
    - duration: 2
      arrivalRate: 2
      rampTo: 20
      name: "Warm up"

    - duration: 10
      arrivalRate: 20
      name: "Load"

scenarios:
  - flow:
      - get:
          url: /api/v4/projects/{{PROJECT_GROUP}}%2F{{PROJECT_NAME}}/merge_requests
          expect:
            - statusCode: 200