artillery/scenarios/git_ls_remote.yml
config:
  defaults:
    headers:
      PRIVATE-TOKEN: "{{ $processEnvironment.ACCESS_TOKEN }}"
      Accept: "application/json"

  ensure:
    maxErrorRate: 1

  plugins:
    expect: {}

  phases:
    - duration: 2
      arrivalRate: 2
      rampTo: 20
      name: "Warm up"

    - duration: 10
      arrivalRate: 20
      name: "Load"

scenarios:
  - flow:
      - get:
          url: /{{PROJECT_GROUP}}/{{PROJECT_NAME}}.git/info/refs?service=git-upload-pack
          expect:
            - statusCode: 200